app/controllers/films_controller.rb

SELECT "films".* FROM "films"
---
    def index
        films = Film.all

INSERT INTO "films" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Mario"], ["description", "Mario 8 bit film"], ["user_id", 1], ["created_at", "2020-01-21 16:10:41.387757"], ["updated_at", "2020-01-21 16:10:41.387757"]]
---
    def create
        film = Film.create(film_params)

SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "films" WHERE "films"."id" = $1  [["id", 1]]
---
    def destroy
        film = Film.find(params[:id])
        film.destroy