app/controllers/frames_controller.rb

    def create
        frame = Frame.create(frame_params)
---
INSERT INTO "frames" ("frame_string", "order", "film_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"